Домашнее задание по pandas бесплатного курса ODS: 
https://habr.com/ru/companies/vk/articles/344044/

In [2]:
import numpy as np
import pandas as pd

pd.set_option("display.max.columns", 100)
# to draw pictures in jupyter notebook
%matplotlib inline

import matplotlib.pyplot as plt
import seaborn as sns

# we don't like warnings
# you can comment the following 2 lines if you'd like to
#  import warnings
#  warnings.filterwarnings("ignore")

In [8]:
# for Jupyter-book, we copy data from GitHub, locally, to save Internet traffic,
# you can specify the data/ folder from the root of your cloned
# https://github.com/Yorko/mlcourse.ai repo, to save Internet traffic
# DATA_URL = "https://raw.githubusercontent.com/Yorko/mlcourse.ai/main/data/"
DATA_LOCAL = "../../data/"

In [9]:
# data = pd.read_csv(DATA_URL + "adult.data.csv")
data = pd.read_csv(DATA_LOCAL + "adult_data.csv")
data.head()

,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

In [7]:
print(data.shape)
print(data.columns)

(32561, 15)
Index(['age', 'workclass', 'fnlwgt', 'education', 'education-num',
       'marital-status', 'occupation', 'relationship', 'race', 'sex',
       'capital-gain', 'capital-loss', 'hours-per-week', 'native-country',
       'salary'],
      dtype='object')

In [41]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 17 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   age               32561 non-null  int64
 1   workclass         32561 non-null  object
 2   fnlwgt            32561 non-null  int64
 3   education         32561 non-null  object
 4   education-num     32561 non-null  int64
 5   marital-status    32561 non-null  object
 6   occupation        32561 non-null  object
 7   relationship      32561 non-null  object
 8   race              32561 non-null  object
 9   sex               32561 non-null  object
 10  capital-gain      32561 non-null  int64
 11  capital-loss      32561 non-null  int64
 12  hours-per-week    32561 non-null  int64
 13  native-country    32561 non-null  object
 14  salary            32561 non-null  object
 15  hight school      32561 non-null  bool
 16  marital-positive  32561 non-null  bool
dtypes: bool(2), int64(6), object(9)
memory usage: 3.8+ MB
None

In [10]:
data["sex"].value_counts()

Male      21790
Female    10771
Name: sex, dtype: int64

In [11]:
data["sex"].value_counts(normalize=True)

Male      0.669205
Female    0.330795
Name: sex, dtype: float64

In [15]:
data[data["sex"] == 'Female']["age"].mean()

36.85823043357163

In [16]:
data["native-country"].value_counts(normalize=True)

United-States                 0.895857
Mexico                        0.019748
?                             0.017905
Philippines                   0.006081
Germany                       0.004207
Canada                        0.003716
Puerto-Rico                   0.003501
El-Salvador                   0.003255
India                         0.003071
Cuba                          0.002918
England                       0.002764
Jamaica                       0.002488
South                         0.002457
China                         0.002303
Italy                         0.002242
Dominican-Republic            0.002150
Vietnam                       0.002058
Guatemala                     0.001966
Japan                         0.001904
Poland                        0.001843
Columbia                      0.001812
Taiwan                        0.001566
Haiti                         0.001351
Iran                          0.001321
Portugal                      0.001136
Nicaragua                     0.001044
Peru                          0.000952
France                        0.000891
Greece                        0.000891
Ecuador                       0.000860
Ireland                       0.000737
Hong                          0.000614
Cambodia                      0.000584
Trinadad&Tobago               0.000584
Laos                          0.000553
Thailand                      0.000553
Yugoslavia                    0.000491
Outlying-US(Guam-USVI-etc)    0.000430
Honduras                      0.000399
Hungary                       0.000399
Scotland                      0.000369
Holand-Netherlands            0.000031
Name: native-country, dtype: float64

In [19]:
data[data["salary"] == '>50K']["age"].describe()
#  data["salary"].value_counts()

count    7841.000000
mean       44.249841
std        10.519028
min        19.000000
25%        36.000000
50%        44.000000
75%        51.000000
max        90.000000
Name: age, dtype: float64

In [24]:
data.pivot_table(
    ["age"],
    ["salary"],
    aggfunc=[np.mean, np.std, np.min, np.max] ,
    # aggfunc="std",
).head(10)

             mean        std amin amax
              age        age  age  age
salary
<=50K   36.783738  14.020088   17   90
>50K    44.249841  10.519028   19   90

In [26]:
data[data["salary"] == '>50K']["education"].value_counts()

Bachelors       2221
HS-grad         1675
Some-college    1387
Masters          959
Prof-school      423
Assoc-voc        361
Doctorate        306
Assoc-acdm       265
10th              62
11th              60
7th-8th           40
12th              33
9th               27
5th-6th           16
1st-4th            6
Name: education, dtype: int64

In [30]:
data["hight school"] = data["education"].isin(['Bachelors', 'Prof-school', 'Assoc-acdm', 'Assoc-voc', 'Masters', 'Doctorate'])

data[data["salary"] == '>50K']["hight school"].value_counts()

True     4535
False    3306
Name: hight school, dtype: int64

Примечательно, что с высшим образованием, с большей вероятностью ЗП будет всё равно меньше 50к, но без него вероятность выше в разы:

In [31]:
pd.crosstab(data["salary"], data["hight school"])

hight school  False  True
salary
<=50K         18739   5981
>50K           3306   4535

In [32]:
pd.crosstab(data["salary"], data["hight school"], normalize=True)

hight school     False     True
salary
<=50K         0.575504  0.183686
>50K          0.101533  0.139277

In [33]:
data["race"].value_counts()
#  data[data["salary"] == '>50K']["hight school"].value_counts()

White                 27816
Black                  3124
Asian-Pac-Islander     1039
Amer-Indian-Eskimo      311
Other                   271
Name: race, dtype: int64

In [34]:
data[data["race"] == 'Amer-Indian-Eskimo']["age"].agg([np.mean, np.std, np.min, np.max])

mean    37.173633
std     12.447130
amin    17.000000
amax    82.000000
Name: age, dtype: float64

In [35]:
data["marital-status"].value_counts()

Married-civ-spouse       14976
Never-married            10683
Divorced                  4443
Separated                 1025
Widowed                    993
Married-spouse-absent      418
Married-AF-spouse           23
Name: marital-status, dtype: int64

In [36]:
data["marital-positive"] = data["marital-status"].isin(['Married-civ-spouse', 'Married-spouse-absent', 'Married-AF-spouse'])

data[data["salary"] == '>50K']["marital-positive"].value_counts()

True     6736
False    1105
Name: marital-positive, dtype: int64

In [38]:
data["hours-per-week"].max()

99

In [42]:
data[data["hours-per-week"] == 99]["hours-per-week"].value_counts()

99    85
Name: hours-per-week, dtype: int64

In [6]:
data[data["hours-per-week"] == 99]["salary"].value_counts(normalize=True)

<=50K    0.705882
>50K     0.294118
Name: salary, dtype: float64

In [5]:
data[data["native-country"]=='Japan'].groupby(by='salary')["hours-per-week"].agg([np.mean, np.std, np.min, np.max])

             mean        std  amin  amax
salary
<=50K   41.000000  11.902759    10    65
>50K    47.958333  16.120414    21    99